package homework25.task1;

import java.util.Scanner;

/*
1.Пользователь вводит в консоль 10 чисел.
2.Соберите их в массив и отсортируйте (любым способом, кроме заложенных в джава)
3. Бинарным поиском найдите число в этом массиве, которое пользователь введет 11ым. Выведите его индекс на экран

Усложнения для первого задания:
1. Вводится не 10 чисел, а строка содержащая числа, записанные через пробелы
2. Бинарный поиск обязательно должен быть реккурсивным
 */
public class Task1 {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        int [] array = new int[10];
        System.out.println("Input numbers");
        int n1 = scanner.nextInt();
        int n2 = scanner.nextInt();
        int n3 = scanner.nextInt();


    }
}
